<?php

/**
 *
 *
 */
$common = array(
    //模块名称
    'modules' => array('1' => '系统',),
    //性别
    'sex' => array('0' => '不明确', '1' => '男', '2' => '女', '3' => '保密'),
    //
    'usersex' => array('0' => '保密', '1' => '男', '2' => '女'),
    'boolstatus' => array(
        '0' => '否',
        '1' => '是',
    ),
    'openstatus' => array(
        '0' => '暂停营业',
        '1' => '正常营业'
    ),
    'clerkstatus' => array(
        '1' => '启用',
        '0' => '停用'
    ),
    'parttype' => array(
        '1' => '店长',
        '2' => '收银员',
        '3' => '导购员',
    ),
    'cost_month_check' => array(
        '0' => '未审核',
        '1' => '已审核'
    ),
    'order_nature' => array(
        'is_lock' => '锁定单',
        'is_combine' => '合并单',
        'is_split' => '拆分单',
        'is_change_record' => '换货单',
        'is_handwork' => '手工单',
        'is_copy' => '复制单',
        'is_fenxiao' => '分销单',
        'sale_mode' => '预售单'
    ),
    'havestatus' => array(
        '0' => '无',
        '1' => '有',
    ),
    'yglx' => array(
        '1' => '采购业务员',
        '2' => '客服',
        '3' => '仓储',
        '9' => '其他',
    ),
    //是否黑名单
    'is_black' => array(
        '0' => '否',
        '1' => '是',
    ),
    //平台来源
    'source' => array(
        '9' => '淘宝',
    //'13'=>'京东',
    //'16'=>'一号店',
    //'14'=>'亚马逊',
    ),
    //短信模板类型
    'smsmobantype' => array(
        '1' => '确认订单短信通知模版',
        '2' => '发货成功短信通知模版',
        '3' => '网单回写成功短信通知模版',
        '4' => '客户确认收获短信通知模版',
        '5' => '会员群发短信模版',
        '6' => '自定义短信模版',
    ),
    //计划任务状态
    'schedule_status' => array(
        '1' => '开启',
        '2' => '关闭'
    ),
    //计划任务执行类型
    'schedule_lx' => array(
        '1' => '循环间隔执行',
        '2' => '每天定点执行',
        '3' => '每周定点执行',
        '4' => '每月定点执行',
    ),
    //天数
    'schedule_day' => array(
        '01' => '01', '02' => '02', '03' => '03', '04' => '04', '05' => '05', '06' => '06', '07' => '07', '08' => '08', '09' => '09', '10' => '10', '11' => '11', '12' => '12',
        '13' => '13', '14' => '14', '15' => '15', '16' => '16', '17' => '17', '18' => '18', '19' => '19', '20' => '20', '21' => '21', '22' => '22', '23' => '23', '24' => '24',
        '25' => '25', '26' => '26', '27' => '27', '28' => '28', '29' => '29', '30' => '30', '31' => '31'
    ),
    //星期
    'schedule_week' => array(
        '1' => '星期一', 2 => '星期二', 3 => '星期三', 4 => '星期四', 5 => '星期五', 6 => '星期六', 7 => '星期日'
    ),
    //小时
    'schedule_hour' => array(
        '00' => '00', '01' => '01', '02' => '02', '03' => '03', '04' => '04', '05' => '05', '06' => '06', '07' => '07', '08' => '08', '09' => '09', '10' => '10', '11' => '11',
        '12' => '12', '13' => '13', '14' => '14', '15' => '15', '16' => '16', '17' => '17', '18' => '18', '19' => '19', '20' => '20', '21' => '21', '22' => '22', '23' => '23'
    ),
    //分钟
    'schedule_min' => array(
        '00' => '00', '01' => '01', '02' => '02', '03' => '03', '04' => '04', '05' => '05', '06' => '06', '07' => '07', '08' => '08', '09' => '09', '10' => '10', '11' => '11'
        , '12' => '12', '13' => '13', '14' => '14', '15' => '15', '16' => '16', '17' => '17', '18' => '18', '19' => '19', '20' => '20', '21' => '21', '22' => '22', '23' => '23'
        , '24' => '24', '25' => '25', '26' => '26', '27' => '27', '28' => '28', '29' => '29', '30' => '30', '31' => '31', '32' => '32', '33' => '33', '34' => '34'
        , '35' => '35', '36' => '36', '37' => '37', '38' => '38', '39' => '39', '40' => '40', '41' => '41', '42' => '42', '43' => '43', '44' => '44'
        , '45' => '45', '46' => '46', '47' => '47', '48' => '48', '49' => '49', '50' => '50', '51' => '51', '52' => '52', '53' => '53', '54' => '54', '55' => '55'
        , '56' => '56', '57' => '57', '58' => '58', '59' => '59'
    ),
    //网店商品状态
    'approve_status' => array(
        '0' => '在售',
        '1' => '在库'
    ),
    //是否默认
    'is_default' => array(
        '0' => '否',
        '1' => '是'
    ),
    //api sku状态
    'item_sku_status' => array(
        'normal' => '正常',
        'delete' => '删除'
    ),
    //库存流水类型
    'inv_record_type' => array(
        '8' => '库存调整单',
        '14' => '电商订单',
        '15' => '电商退单',
    ),
    //付款类型
    'pay_type' => array(
        'secured' => '担保交易',
        'nosecured' => '在线支付',
        'cod' => '货到付款',
    ),
    //回写状态
    'is_back' => array(
        '0' => '未回写',
        '1' => '已回写',
        '2' => '回写失败',
    ),
    //财务退款状态
    'account_refund_status' => array(
        '0' => '未审核',
        '1' => '已审核',
        '2' => '已退回',
    ),
    //退单类型
    'return_order_type' => array(
        '1' => '退款单',
        '2' => '退货单',
        '3' => '退款退货单',
    ),
    //退单类型
    'return_type' => array(
        '1' => '退款单',
        '2' => '退货单',
        '3' => '退款退货单',
    ),
    //退单状态
    'return_order_status' => array(
        '0' => '未信息审核',
        '1' => '已信息审核',
        '3' => '已作废',
    ),
    //入库状态
    'store_in_status' => array(
        '0' => '未入库',
        '1' => '已验收入库',
        '2' => '已通知仓库收货',
    ),
    //网单发货状态
    'order_send_status' => array(
        '0' => '未回写',
        '1' => '回写成功',
        '2' => '本地回写成功',
        '-1' => '回写失败',
//         '-2' => '上传失败，需重试',
    ),
    //缺货状态
    'is_stock_out' => array(
        '1' => '不缺货',
        '2' => '部分缺货',
        '0' => '完全缺货',
    ),
    //零售结算明细单:单据类型
    'order_attr' => array(
        '1' => '销售',
        '2' => '退货',
        '3' => '调整',
    ),
    //零售结算明细单:核销状态
    'check_accounts_status' => array(
        '1' => '已核销',
        '0' => '未核销',
    ),
    //售后服务单导出商品类型
    'goods_type' => array(
        '0' => '退货',
        '1' => '换货'
    ),
    'less_than_safe_num' => array(
        '1' => '仅显示低于安全库存商品',
    ),
    'is_cod' => array(
        '0' => '否',
        '1' => '是'
    ),
    'is_nvoice' => array(
        '0' => '否',
        '1' => '是'
    ),
    'is_rush' => array(
        '0' => '否',
        '1' => '是'
    ),
    'is_fenxiao' => array(
        '0' => '否',
        '1' => '是'
    ),
    'is_jhs' => array(
        '0' => '否',
        '1' => '是'
    ),
    'goods_status' => array(
        '0' => '启用',
        '1' => '停用'
    ),
    'tag' => array(
        '0' => '正常',
        '1' => 'SKU异常',
        '2' => '无名单',
        '3' => '无退货申请',
    ),
    'relation_return' => array(
        '0' => '否',
        '1' => '是'
    ),
    'is_sure' => array(
        '0' => '未确认',
        '1' => '已确认'
    ),
    'is_pre_profit_and_loss' => array(
        '0' => '未盘点',
        '1' => '已盘点'
    ),
    'is_stop' => array(
        '0' => '未终止',
        '1' => '已终止'
    ),
    'is_check_and_accept' => array(
        '0' => '未验收',
        '1' => '已验收'
    ),
    'is_store_out' => array(
        '0' => '未验收',
        '1' => '已验收'
    ),
    'payment_type' => array(
        'secured' => '担保交易',
        'cod' => '货到付款',
        'else' => '其他',
    ),
    'vip_type' => array(
        '1' => '正常',
        '2' => '黑名单',
        '3' => '禁言',
    ),
    'is_build' => array(
        '1' => '已生成',
        '0' => '未生成',
    ),
    'api_goods_status' => array(
        '0' => '在库',
        '1' => '在售'
    ),
    'platform_goods_status' => array(
        '1' => '未匹配',
        '2' => '已匹配'
    ),
    'planned_record_status' => array(
        'is_check_0' => '未确认',
        'is_check_1' => '已确认',
        'is_execute_0' => '未生成通知单',
        'is_execute_1' => '已生成通知单',
        'is_finish_0' => '未完成',
        'is_finish_1' => '已完成',
    ),
    'fx_purchase_return_status' => array(
        'is_check_0' => '未确认',
        'is_check_1' => '已确认',
        'is_store_in_0' => '未入库',
        'is_store_in_1' => '已入库',
        'is_store_in_2' => '部分入库',
        'is_settlement_0' => '未结算',
        'is_settlement_1' => '已结算',
    ),
    'record_nature' => array(
        'is_presale' => '预售单',
        'is_fenxiao' => '分销单',
        'is_rush' => '加急单',
        'is_combine'=>'合并单',
        'is_split'=>'拆分单',
        'is_handwork'=>'手工单',
        'is_copy'=>'复制单',
        'is_change_record'=>'换货单',
        'is_replenish'=>'补单'
    ),
    'record_type' => array(
        '0' => '已发货',
        '1' => '全部',
        '2' => '未发货',
    ),
    'abstract' => array(
        'cash_recharge' => '现金充值',
        'other_recharge' => '其他充值',
        'order_pay' => '订单付款',
        'other_pay' => '其他付款',
        'refund' => '退款',
        'tag_red' => '红冲',
    ),
    'pay_status' => array(
        '2' => '已全部付款',
        '1' => '未全部付款',
    ),
    'delivery_state' => array(
        '0' => '未出库',
        '1' => '已出库',
    ),
    'entity_type' => array(
        '0' => '直营',
        '2' => '分销',
    ),
    
      'record_type_trends' => array(
        '1' => '已发货',
        'all' => '全部',
        '0' => '未发货',
    ),


    'apply_refund' => array(
        'all' => '全部',
        '1' => '有',
        '0' => '无',
    ),


    'order_status' => array(
        '1' => '已锁定',
        '0' => '未锁定',
        '2' => '已释放',
      //  '3' => '已作废',
    ),

    //是否指定分销商
    'is_custom' => array(
        '1' => '是',
        '0' => '否',
    ),

    'o2o_record_type' => array(
        'sell_record' => '销售订单',
        'sell_return' => '销售退单',
    ),


    'lock_obj' => array(
        '0' => '无',
        '1' => '网络店铺',
    ),
    //发票类型
     'invoice_type' => array(
        '1' => '电子',
        '2' => '普通纸质',
    ),
    //发票性质
     'is_red' => array(
        '0' => '正票',
        '1' => '红票',
    ),
    //发票状态
    'status' => array(
        '0' => '发起开票',
        '1' => '开票成功',
        '2' => '开票失败',
    ),
    //是否验收
    'check_accept' => array(
        'no_accept' => '未验收',
        'accept' => '已验收'       
    ),
    //是否发货
    'check_deliver' => array(
        'no_deliver'=> '未发货',
        'bf_deliver'=> '部分发货',
        'deliver'=> '已发货',
        'cancel' => '已取消'
    ),
    'receive_status' => array(
        '0'=> '未交接',
        '-1'=> '交接失败',
        '1'=> '交接成功'
    ),
    //实物锁定明细-单据类型
    'order_type' => array(
        '1' => '网络订单',
        '3' => '换货单',
        'stm_stock_lock' => '库存锁定单',
        'pur_return_notice' => '采购退货通知单',
        'wbm_notice' => '批发通知单',
        'shift_out' => '移仓单-移出',
    ),

    //ag相关状态
    'ag_status' => array(
        '1' => '退单待转单',
        '2.1' => '退货未入库',
        '2.2' => '原单未全部作废',
        '3' => '待推送处理结果',
        '4' => '待推送审核状态',
        '5' => '完成',
        '6' => '强制完成',
    ),
    //采购通知单
    'finish_status' => array(
        '0' => '未完成',
        '1' => '已完成'
    ),
    //采购统计分析
    'purchase_record_type' => array(
        '0' => '采购进货',
        '1' => '采购退货'
    ),
    //wms外包仓上传状态
    'wms_upload_status' => array(
        '1' => '未上传',
        '2' => '待更新',
        '3' => '已上传',
        '4' => '上传失败'
    ),
);
