<?php

/**
 *
 *
 */
$common = array(
    //模块名称
    'modules' => array('1' => '系统',),
    //性别
    'sex' => array('0' => '不明确', '1' => '男', '2' => '女', '3' => '保密'),
    //
    'boolstatus' => array(
        '0' => '否',
        '1' => '是',
    ),
    'boolstate' => array(
        '0' => '停用',
        '1' => '启用',
    ),
    'yglx' => array(
        '1' => '采购业务员',
        '2' => '客服',
        '3' => '仓储',
        '9' => '其他',
    ),
    //计划任务状态
    'schedule_status' => array(
        '1' => '开启',
        '2' => '关闭'
    ),
    //计划任务执行类型
    'schedule_lx' => array(
        '1' => '循环间隔执行',
        '2' => '每天定点执行',
        '3' => '每周定点执行',
        '4' => '每月定点执行',
    ),
    //天数
    'schedule_day' => array(
        '01' => '01', '02' => '02', '03' => '03', '04' => '04', '05' => '05', '06' => '06', '07' => '07', '08' => '08', '09' => '09', '10' => '10', '11' => '11', '12' => '12',
        '13' => '13', '14' => '14', '15' => '15', '16' => '16', '17' => '17', '18' => '18', '19' => '19', '20' => '20', '21' => '21', '22' => '22', '23' => '23', '24' => '24',
        '25' => '25', '26' => '26', '27' => '27', '28' => '28', '29' => '29', '30' => '30', '31' => '31'
    ),
    //星期
    'schedule_week' => array(
        '1' => '星期一', 2 => '星期二', 3 => '星期三', 4 => '星期四', 5 => '星期五', 6 => '星期六', 7 => '星期日'
    ),
    //小时
    'schedule_hour' => array(
        '00' => '00', '01' => '01', '02' => '02', '03' => '03', '04' => '04', '05' => '05', '06' => '06', '07' => '07', '08' => '08', '09' => '09', '10' => '10', '11' => '11',
        '12' => '12', '13' => '13', '14' => '14', '15' => '15', '16' => '16', '17' => '17', '18' => '18', '19' => '19', '20' => '20', '21' => '21', '22' => '22', '23' => '23'
    ),
    //分钟
    'schedule_min' => array(
        '00' => '00', '01' => '01', '02' => '02', '03' => '03', '04' => '04', '05' => '05', '06' => '06', '07' => '07', '08' => '08', '09' => '09', '10' => '10', '11' => '11'
        , '12' => '12', '13' => '13', '14' => '14', '15' => '15', '16' => '16', '17' => '17', '18' => '18', '19' => '19', '20' => '20', '21' => '21', '22' => '22', '23' => '23'
        , '24' => '24', '25' => '25', '26' => '26', '27' => '27', '28' => '28', '29' => '29', '30' => '30', '31' => '31', '32' => '32', '33' => '33', '34' => '34'
        , '35' => '35', '36' => '36', '37' => '37', '38' => '38', '39' => '39', '40' => '40', '41' => '41', '42' => '42', '43' => '43', '44' => '44'
        , '45' => '45', '46' => '46', '47' => '47', '48' => '48', '49' => '49', '50' => '50', '51' => '51', '52' => '52', '53' => '53', '54' => '54', '55' => '55'
        , '56' => '56', '57' => '57', '58' => '58', '59' => '59'
    ),
    //学历
    'education' => array(
        '01' => '小学',
        '02' => '初中',
        '03' => '高中',
        '04' => '中专',
        '05' => '大专',
        '06' => '本科',
        '07' => '硕士',
        '08' => '博士或以上',
    ),
    //增值服务状态
    'valuetype' => array(
        '0' => '无效',
        '1' => '有效'
    ),
    //营销类型
    'selltype' => array(
        '0' => '租用型',
        '1' => '买断型'
    ),
    //订单过期预警
    'orderover' => array(
        '0' => '一个月',
        '1' => '三个月'
    ),
    //版本类型
    'cpversion' => array(
        '0' => '正式版本',
        '1' => '临时版本(开发版)',
        '2' => '正式版本（补丁）'
    ),
    //云主机档案-云类型
    'servertype' => array(
        '1' => '聚石塔',
        '2' => '京东云',
    ),
    //客户中心-云主机档案，密码类型
    'passtype' => array(
        '1' => 'WEB密码',
        '2' => 'ROOT密码',
    ),
    //组织机构级别
    'orglevel' => array(
        '0' => '总部',
        '1911' => '中心',
        '1912' => '事业部',
        '1913' => '部门',
        '1914' => '小组',
        '1915' => '未定义',
        '2602' => '代理分销商',
        '2603' => '直营店',
        '2604' => '加盟店',
        '2605' => '直营分销商',
        '2621' => '渠道',
        '2622' => '俱乐部',
        '2641' => '加工厂',
        '2642' => '供货商',
        '2660' => '总公司',
        '2661' => '分公司',
        '2662' => '部门',
        '2663' => '区域',
        '2664' => '合作伙伴',
    ),
    //基础数据-产品销售渠道
    'channel_type' => array(
        '1' => '传统线下',
        '2' => '在线订购',
    ),
    //基础数据-产品销售渠道
    'channel_mode' => array(
        '1' => '直营',
        '2' => '渠道',
    ),
    //平台状态
    'ptstate' => array(
        '0' => '不支持',
        '1' => '支持',
    ),
    //服务中心-产品问题提单列表
    'issue_type' => array(
        '1' => '已提交，等待处理',
        '2' => '已拒绝',
        '3' => '已受理，正在解决',
        '4' => '已解决',
        '5' => '研发已介入,正在解决',
        '6' => '无法解决',
        '7' => '已转需求',
    ),
    'issue_source' => array(
        '1' => '服务人员',
        '2' => '客户',
    ),
    //基础数据-云主机列表-用途system_type
    'serveruse' => array(
        '1' => '客户正式',
        '2' => '自用正式',
        '3' => '自用测试'
    ),
    //基础数据-云主机列表-用途
    'servemodel' => array(
        '1' => '小型',
        '2' => '中型',
        '3' => '大型'
    ),
    //基础数据-云主机列表-操作系统
    'system_type' => array(
        '1' => 'Linux',
        '2' => 'Windows',
    ),
    //营销中心-报价方案-付款类型
    'pay_type' => array(
        '1' => '及时付款',
        '2' => '面议',
    ),
    
    //优先级
    'ordertype' => array(
        '1' => '1',
        '2' => '2',
        '3' => '3',
        '4' => '4',
        '5' => '5',
        '6' => '6',
        '7' => '7',
    ),
    //营销中心-产品订购列表-产品版本
    'product_version' => array(
        '1' => '标准版',
        '2' => '企业版',
        '3' => '旗舰版',
    ),
      'product_area' => array(
        '1' => '电商',
        '2' => '线下',
        '3' => '全渠道',
    ),  
    
    
    //需求反馈类型
    'xqsuetype' => array(
        '1' =>'界面风格',
        '2' =>'操作便捷性',
        '3' =>'性能优化',
        '4' =>'精度不准',
        '5' =>'功能新增',
        '6' =>'功能完善',
        '7' =>'数据接口',
        '8' =>'业务定义',
        '9' =>'业务优化',
        '10' =>'功能BUG',
    ),
    
    //服务中心-需求提单状态
    'xqissue_type' => array(
        '1' => '已提交，等待处理',
        '2' => '已拒绝',
        '3' => '已受理，正在审批',
        '4' => '已审批',
        '5' => '已解决',
        '6' => '无法解决',
        '7' => '已上线',
    ),
    
    //服务中心-需求提单处理方式
    'xqsue_processtype' =>array(
        '1' => '程序开发',
        '2' => '后续规划',
    ),
    //营销中心-产品订购列表-产品版本
    'valueserver_type' => array(
        '0' => '菜单功能类型',
        '1' => '自动服务',
        '2' => '店铺类型',
        '3' => 'WMS',
        '4' => '其他类型',
    ),
    //产品中心-产品补丁-补丁状态
    'patch_status' => array(
        '0' => '可用',
        '1' => '全部升级',
        '2' => '不可用',
    ),
    
    //公告类型
    'nottype' => array(
        '1' => '一般',
        '2' => '紧急',
        '3' => '总是'
    ),
    
    //客户帐号类型
    'kh_account_type'=>array(
        '0' => '企业',
        '1' => '个人',
    ),

    //类型
    'share_type' => array(
        '1' => '独享',
        '2' => '共享',
    ),

    'area_type' => array(
        '' => '请选择',
        '1' => '国家',
        '2' => '省/自治区/直辖市',
        '3' => '地级市',
        '4' => '县/市(县级市)/区',
        '5' => '街道'
    ),

    //是否发布
    'is_publish' => array(
        '0' => '未发布',
        '1' => '已发布',
    ),
    'pra_program_version'=>array(
        'standard'=>'正式版本',
        'beta'=>'BETA版本',
        'customer'=>'客制化版本',
    ),

    'xqsue_service_type' =>array(
        '001' => '平台接口',
        '002' => 'WMS接口',
        '003' => 'ERP接口',
        '004' => '网络订单处理',
        '005' => '网络退单处理',
    ),

    'xqsue_plan_week_status' =>array(
        '1' => '未计划',
        '2' => '已计划',
    ),

    'xqsue_urgency' =>array(
        'A' => 'A',
        'B' => 'B',
        'C' => 'C',
        'D' => 'D',
    ),

    'xqsue_difficulty' =>array(
        '001' => '低',
        '002' => '中',
        '003' => '高',
    ),

);
